Repository: trojsten/web
Catalog: trojsten/locale/*/LC_MESSAGES/django.po
Languages: sk

source: Subject
sk: Predmet

source: Name
sk: Meno

source: Message
sk: Správa

source: This form is for reporting technical issues with our web site. If you have a problem with tasks, please send an email directly to the seminary organizers to <a class="alert-link" href="mailto:%(email)s">%(email)s</a>, or to the organizer listed in the task statement.
sk: Tento formulár slúži na technické problémy so stránkou, nie na problémy s riešením úloh. Pokiaľ máte problém s nejakou úlohou, napíšte vedúcim semináru na <a class="alert-link" href="mailto:%(email)s">%(email)s</a>, alebo priamo vedúcemu uvedenému pri úlohe.

source: If you have found any problem with our web site, please let us know using the following form.
sk: Ak ste objavili chybu na našej stránke, prosím, dajte nám vedieť použitím nasledujúceho formulára.

source: year
sk: ročník

source: round
sk: kolo

source: solutions
sk: vzoráky

source: tasks
sk: zadania

source: Send notification to reviewers about new description submit
sk: Zaslať opravovateľom notifikáciu o submite popisu

source: Send notification to reviewers about new code submit
sk: Zaslať opravovateľom notifikáciu o submite kódu

source: organizer
sk: vedúci

source: reviewer
sk: opravovateľ

source: proofreader
sk: recenzovač

source: role
sk: funkcia

source: Assigned user
sk: Pridelený človek

source: Assigned people
sk: Pridelení ľudia

source: Submit programs until
sk: Doprogramovanie do

source: End of the round
sk: Koniec kola

source: Don't submit descriptions. You can still <strong>submit your programs</strong> and receive points for them.
sk: Popisy už neodovzdávajte. Ešte stále však <strong>môžete odosielať vaše programy</strong>, za ktoré dostanete časť bodov.

source: The round has finished.
sk: Kolo už skončilo.

source: View the solution.
sk: Pozrieť vzorové riešenie.

source: authorized groups
sk: autorizované skupiny

source: sources
sk: zdroje

source: Template
sk: Šablóna

source: Participants data
sk: Dáta účastníkov

source: Join into one PDF
sk: Spojiť do jedného PDF

source: Failed to parse the input data
sk: Chyba pri spracovaní dát

source: Source name
sk: Názov zdroja

source: Source class
sk: Trieda zdroja

source: Add to default sources
sk: Pridať do základných zdrojov

source: Data source for diplomas
sk: Zdroj dát pre diplomy

source: Data sources for diplomas
sk: Zdroje dát pre diplomy

source: Sources
sk: Zdroje

source: Authorized groups
sk: Autorizované skupiny

source: The groups that are authorized to use this template.
sk: Skupiny s povolením používať túto šablónu

source: Diploma template
sk: Šablóna diplomu

source: Diploma templates
sk: Šablóny diplomov

source: External input options
sk: Výber externého zdroja

source: Choose a file
sk: Nahrať súbor

source: Categories
sk: Kategórie

source: Limit to first
sk: Iba prvých

source: Scrape data directly from URL (last resort in case Naboj site changes structure)
sk: Stiahni dáta priamo z URL (poistka pre prípad zmien Náboj stránky)

source: Results URL
sk: URL výsledkov

source: This field is not required
sk: Toto pole nie je povinné.

source: Load
sk: Načítať

source: Diplomas
sk: Diplomy

source: Multiple diplomas
sk: Viacero diplomov

source: Single diploma
sk: Jeden diplom

source: Preview
sk: Náhľad

source: Generate
sk: Generovať

source: Replaceable fields:
sk: Nahraditeľné polia:

source: Output options
sk: Možnosti výstupu

source: Template does not exist
sk: Šablóna neexistuje

source: You do not have access to this template
sk: K tejto šablóne nemáte prístup

source: Logout successful
sk: Odhlásenie úspešné

source: New round
sk: Nové kolo

source: Submit reviewed
sk: Popis opravený

source: Submit
sk: Odoslať

source: Subscribed events
sk: Odoberané udalosti

source: Ignored events
sk: Ignorované udalosti

source: Ignored notification
sk: Ignorovaný typ notifikácie

source: Ignored notifications
sk: Ignorované typy notifikácie

source: New round started! %(round)s
sk: Začalo nové kolo! %(round)s

source: Your description for "%(task)s" has been reviewed. You earned %(points)d points!
sk: Tvoj popis úlohy "%(task)s" bol opravený. Získal si %(points)d bodov.

source: Personal info
sk: Osobné údaje

source: Address
sk: Adresa

source: School
sk: Škola

source: Password
sk: Heslo

source: Permissions
sk: Práva

source: Important dates
sk: Dôležité dátumy

source: Users merged succesfully.
sk: Používatelia spojení úspešne.

source: Street
sk: Ulica

source: Town
sk: Mesto

source: Postal code
sk: PSČ

source: Country
sk: Krajina

source: home
sk: domov

source: school
sk: do školy

source: other address (e. g. to a dormitory)
sk: na inú adresu (napr. na internát)

source: Correspondence address
sk: Korešpondenčná adresa

source: Choose, where you want to accept mails.
sk: Vyber, kam ti máme posielať poštu.

source: Gender
sk: Pohlavie

source: This field is required.
sk: Toto pole je povinné.

source: Your graduation year is too far in the past.
sk: Tvoj rok maturity je príliš ďaleko v minulosti.

source: Your graduation year is too far in the future.
sk: Tvoj rok maturity je príliš ďaleko v budúcnosti.

source: We cannot send you correspondence to school when you don't choose any school. If your school is not in the list write us in an e-mail that you want us to send correspodence to school
sk: Nemôžeme ti posielať poštu na školu, pokiaľ si si žiadnu nevybral. Ak sa tvoja škola nenachádza v zozname, napíš v e-maili, že ti máme posielať poštu na školu

source: Password confirmation
sk: Potvrdenie hesla

source: Enter the same password as above, for verification.
sk: Zadaj rovnaké heslo ako vyššie pre jeho overenie

source: We recommend choosing a strong passphrase but we don't enforce any ridiculous constraints on your passwords.
sk: Odporúčame ti vybrať silné heslo, ale nebudeme od teba vyžadovať žiadne smiešne požiadavky

source: Points have to be non-negative and at most {}.
sk: Body musia byť nezáporné a najviac {}.

source: Round
sk: Kolo

source: Reset
sk: Obnoviť

source: Cancel
sk: Zrušiť

source: People
sk: Ľudia

source: Users
sk: Používatelia

source: Submitted tasks
sk: Odovzdané úlohy

source: Tasks submitted by competitor
sk: Úlohy odovzdané riešiteľom

source: You are viewing submits for round:
sk: Prezeráš si odovzdané úlohy pre kolo:

source: Change round
sk: Zmeň kolo

source: Fill which tasks has the competitor sent. You can fill in the points or %(symbol)s for unreviewed tasks. If you want to delete submits, leave the corresponding fields empty. However, in this way, only paper unreviewed submits can be deleted. <br> You can go down through the checkboxes using the tab-key.
sk: Vyplň, ktoré úlohy riešeiteľ poslal. Môžeš mu vyplniť body alebo %(symbol)s pre neopravené úlohy. Ak cheš zmazať nejaké riešenia, nechaj odpovedajúce políčko prázdne. Avšak týmto spôsobom môžeš zmazať len papierové riešenia <br> Políčkami môžeš prechádzať pomocou tabulátora.

source: You have already filled all required properties.
sk: Momentálne máš vyplnené všetky potrebné údaje.

source: We need a little more information
sk: Potrebujeme ešte zopár údajov

source: To participate in some competitions, we need you to fill some more data in addition to those you have filled during registration. Until you fill them, we will not show you in the scoreboard.
sk: Na zapojenie do niektorých súťaží potrebujeme ešte, aby si vyplnil nejaké údaje navyše okrem tých, ktoré si zadal pri registrácii. Pokiaľ ich nevyplníš, nebudeme ťa zobrazovať vo výsledkovej listine.

source: If you want to prevent this message from showing, you may check "I do not want to participate in competition". You can change this later in "Contest" section in Settings.
sk: Pokiaľ nechceš, aby sa ti zobrazovala táto hláška, môžeš tiež zakliknúť "Nechcem sa zapojiť do súťaže". Toto rozhodnutie môžeš neskôr zmeniť v nastaveniach v sekcii "Súťaže".

source: To participate in competition <em>%(competition)s</em> you need to fill:
sk: V súťaži <em>%(competition)s</em> potrebujeme ešte aby si vyplnil tieto údaje:

source: I do not want to participate in competition %(competition)s.
sk: Nechcem sa zapojiť do súťaže %(competition)s.

source: Close
sk: Zavrieť

source: Fill data
sk: Vyplniť údaje

source: Profile
sk: Profil

source: Properties
sk: Vlastnosti

source: Contests
sk: Súťaže

source: Notifications
sk: Notifikácie

source: Login settings
sk: Nastavenia prihlasovania

source: Add property
sk: Pridať vlastnosť

source: Choose which competitions would you like to participate in:
sk: Vyber si súťaže, ktoré chceš riešiť:

source: Choose which events would you like to get notified about:
sk: Vyber si udalosti, o ktorých ťa máme notifikovať:

source: Subscribed events are events that you will be notified about. Ignored events are events which you won't get notified about and we will not resubscribe you automatically.
sk: Odoberané udalosti sú také udalosti, o ktorých ťa budeme notifikovať. Ignorované udalosti sú také udalosti, o ktorých ťa nebudeme notifikovať a ani ťa neprihlásime na ich odber automaticky.

source: You can use any of the following services to log in to your account.
sk: Možete použiť ľubovoľnú z nasledujúcich služieb na prihlásenie.

source: Log in
sk: Prihlásiť sa

source: You can change the login settings <a href="%(TROJSTEN_LOGIN_PROVIDER_URL)s%(settings_url)s#login">on separate page</a>.
sk: Nastavenia prihlásenia si môžeš zmeniť <a href="%(TROJSTEN_LOGIN_PROVIDER_URL)s%(settings_url)s#login">na samostatnej stránke</a>.

source: Password change
sk: Zmena hesla

source: You can change your password <a href="%(passwd_url)s">here</a>.
sk: Heslo si môžeš zmeniť <a href="%(passwd_url)s">tu</a>.

source: File must be a ZIP archive: %s
sk: Súbor musí byť ZIP archív: %s

source: Points are required
sk: Body sú povinné

source: User is required
sk: Používateľ je povinný

source: User %s does not exist
sk: Používateľ %s neexistuje

source: Invalid filename %s
sk: Neplatný názov súboru %s

source: Must have set points
sk: Musíš uviesť body

source: Assigned 2 or more files to the same user.
sk: Rovnaký používateľ má priradené 2 alebo viac súborov.

source: You should upload a file or specify parent submit.
sk: Mal by si nahrať súbor alebo špecifikovať predchádzajúci submit.

source: Review
sk: Opravovanie

source: Edit
sk: Upraviť

source: Task
sk: Úloha

source: Download all original solutions
sk: Stiahnuť všetky pôvodné riešenia

source: (it downloads last submitted solution for each competitor)
sk: (stiahne pre každého užívateľa posledné odovzdané riešenie)

source: Download all reviewed solutions
sk: Stiahnuť všetky opravené riešenia

source: (it downloads reviewed solutions for each competitor if there is any)
sk: (stiahne pre každého užívateľa opravené riešenie, ak je opravené)

source: Download
sk: Stiahnuť

source: View
sk: Pozrieť

source: Add new review
sk: Pridaj opravenie

source: Update points and comments
sk: Aktualizuj body a komentáre

source: View task
sk: Pozrieť úlohu

source: Upload Zip
sk: Nahraj Zip

source: Filename
sk: Názov súboru

source: User
sk: Používateľ

source: Points
sk: Body

source: Comment
sk: Komentár

source: Successfully uploaded a zip file.
sk: Zip súbor bol úspešne nahraný

source: Points and comments were successfully updated.
sk: Body a komentáre boli úspešne aktualizované

source: Successfully saved the review
sk: Opravenie bolo úspešne uložené

source: Missing file of user %s
sk: Chýba súbor používateľa %s

source: Missing source file of user %s
sk: Chýba zdrojový súbor používateľa %s

source: Problems with uploaded zip
sk: Problémy s nahratým zip-om

source: Ignore
sk: Ignorovať

source: Successfully finished reviewing this task!
sk: Úspešne dokončené opravovanie tejto úlohy!

source: reviewed
sk: opravený

source: in queue
sk: v poradí

source: finished
sk: ukončený

source: Wrong answer
sk: Zlá odpoveď

source: Compilation error
sk: Chyba počas kompilácie

source: Time limit exceeded
sk: Prekročený časový limit

source: Memory limit exceeded
sk: Prekročený pamäťový limit

source: Runtime exception
sk: Chyba počas behu programu

source: Security exception
sk: Pokus o narušenie bezpečnosti

source: Protocol corrupted
sk: Nečitateľný protokol

source: Here you can upload a file with submit description
sk: Tu môžeš nahrať súbor s popisom riešenia

source: You can attach a submit file only to descriptions.
sk: Nahrať súbor môžeš len k popisom.

source: My submitted tasks
sk: Moje odovzdané úlohy

source: Show comment
sk: Pozri komentár

source: View comment
sk: Pozri komentár

source: Details
sk: Detaily

source: [Trojstenweb] User submission detected
sk: [Trojstenweb] Nový submit uživateľa

source: {name} submitted solution to task {task}
sk: Uživateľ {name} submitol riešenie úlohy {task}

source: Link for reviewing: {review_link}
sk: Link na opravovanie: {review_link}

source: You have successfully submitted your description, it will be reviewed after the round finishes.
sk: Úspešne sa ti podarilo submitnúť popis, po skončení kola ti ho vedúci opravia.

source: You have submitted your description after the deadline. It is not counted in results.
sk: Nahral si svoj popis riešenia po termíne kola. Nebude zarátaný vo výsledkovke.

source: Preview of your comment
sk: Náhľad komentára

source: Anonymous
sk: Anonym

source: on %(submit_date)s
sk: %(submit_date)s

source: reply
sk: reagovať

source: Comments are closed.
sk: Diskusia je uzavretá.

source: Post
sk: Odoslať

source: Registration
sk: Registrácia

source: Search results for:
sk: Výsledky hľadania pre

source: Your search returned <strong>%(cnt)s</strong> results.
sk: Nájdených <strong>%(cnt)s</strong> výskytov.

source: Title
sk: Názov

source: Last modified
sk: Naposledy upravené

source: There are no articles in this level
sk: Na tejto úrovni nie sú žiadne články.

source: Previous
sk: Predchádzajúca

source: Next
sk: Nasledujúca

source: This article was last modified:
sk: Čas poslednej úpravy:
